<?php
/*Красная Шапочка часто навещает свою бабушку.
Но она очень боится, что рано или поздно ее
бабушку опять навестит волк. Поэтому она решила
договориться с Лесничим об охране бабушки.
Лесничий согласился охранять бабушку за 10 пирожков.
Узнав об этом, волк сказал Красной Шапочке,
что ей совершенно незачем тратить пирожки на Лесничего.
За половину тех пирожков, которые Красная Шапочка несет бабушке,
Волк пообещал не трогать ее. Мама испекла несколько пирожков,
и попросила Красную Шапочку отнести их бабушке.
Требуется определить, сколько пирожков Красная Шапочка
сможет донести до бабушки.*/

$n = (int)readline('Сколько пирожков испекла мама? ');
$m = (int)($n / 2);
echo $m;
?>
